bitplane/nokia-dct3-re/cpu/tms320c54x/tms320c54x.cpp
u64 tms320c54x_device::data_operand(u16 value) const
{
	if (BIT(m_st1, 8) && BIT(value, 15))
		return u64(s64(s16(value))) & ACC_MASK;
	return value;
}

u64 tms320c54x_device::arithmetic_shift_right(u64 value, unsigned shift) const
{
	const s64 signed_value = s64(value << 24) >> 24;
	return u64(signed_value >> shift) & ACC_MASK;
}

void tms320c54x_device::indirect_modify(u8 mode)
{
	const unsigned ar = mode & 7;
	switch (mode & 0x78)
	{
	case 0x08: --m_ar[ar]; break;
	case 0x10: ++m_ar[ar]; break;
	case 0x18: ++m_ar[ar]; break;
	case 0x20: m_ar[ar] -= m_ar[0]; break;
	case 0x28: m_ar[ar] -= m_ar[0]; break;
	case 0x30: m_ar[ar] += m_ar[0]; break;
	case 0x38: m_ar[ar] += m_ar[0]; break;
	case 0x40: circular_modify(ar, -1); break;
	case 0x48: circular_modify(ar, -s16(m_ar[0])); break;
	case 0x50: circular_modify(ar, 1); break;
	case 0x58: circular_modify(ar, s16(m_ar[0])); break;
	default: break;
	}
	// In compatibility mode, a nonzero ARF both selects the auxiliary register
	// and publishes it into ST0.ARP.  Standard mode addresses ARF directly and
	// must leave ARP cleared/unchanged (TMS320C54x CPU Reference Guide 5.5.1).
	if (BIT(m_st1, 5) && ar)
		m_st0 = (m_st0 & ~u16(0xe000)) | u16(ar << 13);
}

void tms320c54x_device::dual_modify(u8 operand)
{
	const unsigned ar = 2 + (operand & 3);
	switch ((operand >> 2) & 3)
	{
	case 0: break;
	case 1: --m_ar[ar]; break;
	case 2: ++m_ar[ar]; break;
	case 3: circular_modify(ar, s16(m_ar[0])); break;
	}
}

void tms320c54x_device::circular_modify(unsigned ar, s16 step)
{
	if (!m_bk)
		return;
	unsigned address_bits = 0;
	while ((1U << address_bits) <= m_bk && address_bits != 16)
		++address_bits;
	const u32 mask = address_bits == 16 ? 0xffff : (1U << address_bits) - 1;
	const u16 base = m_ar[ar] & ~mask;
	s32 index = (m_ar[ar] & mask) + step;
	while (index >= m_bk)
		index -= m_bk;
	while (index < 0)
		index += m_bk;
	m_ar[ar] = base | u16(index);
}

u16 tms320c54x_device::indirect_read(u8 mode)
{
	if (mode == 0xf8)
		return data_read(fetch());
	const unsigned ar = mode & 7;
	const bool preincrement = (mode & 0x78) == 0x18;
	if (preincrement)
		indirect_modify(mode);
	const u16 value = data_read(m_ar[ar]);
	if (!preincrement)
		indirect_modify(mode);
	return value;
}

void tms320c54x_device::indirect_write(u8 mode, u16 value)
{
	if (mode == 0xf8)
	{
		data_write(fetch(), value);
		return;
	}
	const unsigned ar = mode & 7;
	const bool preincrement = (mode & 0x78) == 0x18;
	if (preincrement)
		indirect_modify(mode);
	data_write(m_ar[ar], value);
	if (!preincrement)
		indirect_modify(mode);
}

void tms320c54x_device::finish_repeats()
{
	// This is the first retirement of the repeated body.  Capture its extent
	// now that its instruction length is known; #n executes the body n+1 times.
	if (m_rpt_armed)
	{
		m_rpt_armed = false;
		m_rpt_end = m_pc;
		if (m_rptc)
		{
			--m_rptc;
			++m_rpt_iteration;
			m_pc = m_rpt_address;
		}
		else
		{
			m_rpt_end = 0xffff;
			m_rpt_iteration = 0;
		}
		return;
	}

	if (m_rptc)
	{
		if (m_rpt_end == 0xffff)
			m_rpt_end = m_pc;
		if (m_pc == m_rpt_end)
		{
			--m_rptc;
			++m_rpt_iteration;
			m_pc = m_rpt_address;
		}
	}
	else if (m_rpt_end != 0xffff && m_pc == m_rpt_end)
	{
		m_rpt_end = 0xffff;
		m_rpt_iteration = 0;
	}

	// REA names the last program word in the block. This also covers a
	// multiword CALL at the end of the block after its RET restores REA+1.
	if (m_block_repeat_active && m_pc == u16(m_rea + 1))
	{
		if (m_brc)
		{
			--m_brc;
			m_pc = m_rsa;
		}
		else
		{
			m_block_repeat_active = false;
			m_st1 &= ~ST1_BRAF;
		}
	}
}

bool tms320c54x_device::service_interrupt()
{
	// Maskable hardware sources occupy vectors 16..31 and map directly to
	// IMR/IFR bits 0..15. PMST.IPTR selects their 128-word vector page.
	const u16 pending = m_ifr & m_imr;
	// The C54x does not recognize an interrupt between a delayed control
	// transfer and its two delay words, nor between RPT/RPTZ and the repeated
	// instruction. IFR remains set and is reconsidered at the next legal
	// instruction boundary. Taking it inside either atomic sequence can skip a
	// vector prologue's context-save slots and corrupt the return stack.
	const bool single_repeat_active = m_rpt_armed || m_rptc || m_rpt_end != 0xffff;
	if (BIT(m_st1, 11) || !pending || m_delayed_words || m_xc_guard ||
			single_repeat_active)
		return false;

	unsigned source = 0;
	while (!BIT(pending, source))
		++source;
	m_ifr &= ~(u16(1) << source);
	m_rtn = m_pc;
	push(m_pc);
	m_st1 |= 0x0800;
	m_pc = (m_pmst & 0xff80) | ((source + 16) << 2);
	m_idle = false;
	m_icount -= 5;
	return true;
}

void tms320c54x_device::execute_one(u16 op)
{
	const u8 low = op;
	if ((op & 0xfcff) == 0xf4e1) // IDLE 1/2/3
	{
		m_idle = true;
		return;
	}
	if ((op & 0xfdf0) == 0xf5b0) // SSBX bit, ST0/ST1
	{
		u16 &status = BIT(op, 9) ? m_st1 : m_st0;
		status |= u16(1) << (low & 0x0f);
		return;
	}
	if ((op & 0xfdf0) == 0xf4b0) // RSBX bit, ST0/ST1
	{
		u16 &status = BIT(op, 9) ? m_st1 : m_st0;
		status &= ~(u16(1) << (low & 0x0f));
		return;
	}
	if ((op & 0xfcff) == 0xf485) // ABS src, dst
	{
		const bool source_b = BIT(op, 9);
		const bool destination_b = BIT(op, 8);
		const u64 raw = accumulator(source_b) & ACC_MASK;
		const s64 value = s64(raw << 24) >> 24;
		const bool overflow = raw == (u64(1) << 39);
		u64 result = value < 0 ? (-value & ACC_MASK) : raw;
		if (overflow && BIT(m_st1, 9)) // OVM
			result = (u64(1) << 39) - 1;
		accumulator(destination_b) = result;
		const u16 overflow_mask = u16(1) << (destination_b ? 9 : 10);
		m_st0 = (m_st0 & ~overflow_mask) | (overflow ? overflow_mask : 0);
		return;
	}
	if ((op & 0xfd00) == 0xfd00) // XC n, condition
	{
		const unsigned words = BIT(op, 9) ? 2 : 1;
		bool execute = false;
		if (BIT(low, 6))
		{
			const bool b = BIT(low, 3);
			const u64 value = accumulator(b);
			const s64 signed_value = s64(value << 24) >> 24;
			execute = true;
			switch (low & 7)
			{
			case 0: break;
			case 2: execute = signed_value >= 0; break;
			case 3: execute = signed_value < 0; break;
			case 4: execute = value != 0; break;
			case 5: execute = value == 0; break;
			case 6: execute = signed_value > 0; break;
			case 7: execute = signed_value <= 0; break;
			default: execute = false; break;
			}
			if (BIT(low, 5))
			{
				const bool overflow = BIT(m_st0, b ? 9 : 10);
				execute = execute && (BIT(low, 4) ? overflow : !overflow);
			}
		}
		else
		{
			execute = true;
			if (low & 0x30)
				execute = execute && ((low & 0x30) == 0x30
						? BIT(m_st0, 12) : !BIT(m_st0, 12));
			if (low & 0x0c)
				execute = execute && ((low & 0x0c) == 0x0c
						? BIT(m_st0, 11) : !BIT(m_st0, 11));
			if (low & 0x03)
			{
				// BIO defaults deasserted until a board supplies the input line.
				execute = execute && ((low & 0x03) == 0x02);
			}
		}
		if (!execute)
			m_pc += words;
		else
			m_xc_guard = words;
		return;
	}
	if ((op & 0xfcf0) == 0xf050) // XOR #lk, shift, source, destination
	{
		const u64 value = u64(fetch()) << (low & 0x0f);
		accumulator(BIT(op, 8)) = (accumulator(BIT(op, 9)) ^ value) & ACC_MASK;
		return;
	}
	if ((op & 0xfce0) == 0xf420) // SUB source accumulator, shift, destination accumulator
	{
		const int shift = s8((op & 0x1f) << 3) >> 3;
		const u64 source = accumulator(BIT(op, 9));
		const u64 value = shift < 0 ? arithmetic_shift_right(source, -shift) :
				(source << shift) & ACC_MASK;
		u64 &destination = accumulator(BIT(op, 8));
		destination = (destination - value) & ACC_MASK;
		return;
	}
	if ((op & 0xfce0) == 0xf400) // ADD source accumulator, shift, destination accumulator
	{
		const int shift = s8((op & 0x1f) << 3) >> 3;
		const u64 source = accumulator(BIT(op, 9));
		const u64 value = shift < 0 ? arithmetic_shift_right(source, -shift) :
				(source << shift) & ACC_MASK;
		u64 &destination = accumulator(BIT(op, 8));
		destination = (destination + value) & ACC_MASK;
		return;
	}
	if ((op & 0xfce0) == 0xf080) // AND source accumulator, shift, destination accumulator
	{
		const int shift = s8((op & 0x1f) << 3) >> 3;
		const u64 source = accumulator(BIT(op, 9));
		const u64 value = shift < 0 ? source >> -shift :
				(source << shift) & ACC_MASK;
		accumulator(BIT(op, 8)) &= value;
		return;
	}
	if ((op & 0xfce0) == 0xf0a0) // OR source accumulator, shift, destination accumulator
	{
		const int shift = s8((op & 0x1f) << 3) >> 3;
		const u64 source = accumulator(BIT(op, 9));
		const u64 value = shift < 0 ? source >> -shift :
				(source << shift) & ACC_MASK;
		accumulator(BIT(op, 8)) |= value;
		return;
	}
	if ((op & 0xfce0) == 0xf0e0) // SFTL source accumulator, shift, destination accumulator
	{
		const int shift = s8((op & 0x1f) << 3) >> 3;
		const u64 source = accumulator(BIT(op, 9));
		accumulator(BIT(op, 8)) = shift < 0 ? source >> -shift :
				(source << shift) & ACC_MASK;
		return;
	}
	if ((op & 0xfcff) == 0xf482) // LD source accumulator, ASM, destination accumulator
	{
		const int shift = s8((m_st1 & 0x1f) << 3) >> 3;
		const u64 source = accumulator(BIT(op, 9));
		accumulator(BIT(op, 8)) = shift < 0 ? arithmetic_shift_right(source, -shift) :
				(source << shift) & ACC_MASK;
		return;
	}
	if ((op & 0xff00) == 0x6f00)
	{
		const bool absolute = low == 0xf8;
		const u16 address = absolute ? fetch() : 0;
		const u16 extension = fetch();
		const int shift = s8((extension & 0x1f) << 3) >> 3;
		auto shifted = [this, shift](u64 value)
		{
			return shift < 0 ? arithmetic_shift_right(value, -shift) :
					(value << shift) & ACC_MASK;
		};
		auto read_operand = [this, absolute, address, low]()
		{
			return absolute ? data_read(address) : indirect_read(low);
		};
		auto write_operand = [this, absolute, address, low](u16 value)
		{
			if (absolute)
				data_write(address, value);
			else
				indirect_write(low, value);
		};
		if ((extension & 0xfee0) == 0x0c40) // LD Smem, shift, dst
			accumulator(BIT(extension, 8)) = shifted(data_operand(read_operand()));
		else if ((extension & 0xfee0) == 0x0c60) // STH src, shift, Smem
			write_operand(u16(shifted(accumulator(BIT(extension, 8))) >> 16));
		else if ((extension & 0xfee0) == 0x0c80) // STL src, shift, Smem
			write_operand(u16(shifted(accumulator(BIT(extension, 8)))));
		else if ((extension & 0xfce0) == 0x0c00) // ADD Smem, shift, src, dst
			accumulator(BIT(extension, 8)) =
					(accumulator(BIT(extension, 9)) + shifted(data_operand(read_operand()))) & ACC_MASK;
		else if ((extension & 0xfce0) == 0x0c20) // SUB Smem, shift, src, dst
			accumulator(BIT(extension, 8)) =
					(accumulator(BIT(extension, 9)) - shifted(data_operand(read_operand()))) & ACC_MASK;
		else
		{
			logerror("%s: unimplemented C54x extended opcode %04x/%04x at %04x\n",
					machine().describe_context(), op, extension, u16(m_pc - 3));
			m_illegal = true;
			return;
		}
		return;
	}
	if ((op & 0xfc00) == 0xf000 && ((op >> 4) & 0x0f) <= 5)
	{
		// Immediate accumulator ALU family.  Bit 9 selects the source,
		// bit 8 the destination, and the low nibble is the shift count.
		const unsigned operation = (op >> 4) & 0x0f;
		const unsigned shift = op & 0x0f;
		const u16 immediate = fetch();
		const u64 source = accumulator(BIT(op, 9));
		u64 &destination = accumulator(BIT(op, 8));
		const u64 operand = operation <= 2 ?
				((u64(s64(s16(immediate))) << shift) & ACC_MASK) :
				(u64(immediate) << shift);
		switch (operation)
		{
		case 0: destination = (source + operand) & ACC_MASK; break;
		case 1: destination = (source - operand) & ACC_MASK; break;
		case 2: destination = operand; break;
		case 3: destination = source & operand; break;
		case 4: destination = source | operand; break;
		case 5: destination = source ^ operand; break;
		}
		return;
	}
	if (op == 0x70f8) // MVKD dmad, Smem (absolute destination form)
	{
		const u16 destination = fetch();
		const u16 source = fetch();
		data_write(destination, data_read(source));
		return;
	}
	if ((op & 0xfce0) == 0xf400 || (op & 0xfce0) == 0xf420 ||
			(op & 0xfce0) == 0xf440 || (op & 0xfce0) == 0xf460)
	{
		// Accumulator arithmetic with a signed five-bit shift.  Bit 9 selects
		// the source and bit 8 the destination.
		const unsigned operation = (op >> 5) & 3;
		const int shift = s8(u8(op << 3)) >> 3;
		u64 source = accumulator(BIT(op, 9));
		if (shift >= 0)
			source = (source << shift) & ACC_MASK;
		else if (operation == 3)
			source = arithmetic_shift_right(source, -shift);
		else
			source >>= -shift;
		u64 &destination = accumulator(BIT(op, 8));
		switch (operation)
		{
		case 0: destination = (destination + source) & ACC_MASK; break;
		case 1: destination = (destination - source) & ACC_MASK; break;
		case 2: destination = source; break;
		case 3: destination = source; break; // SFTA differs only in flag effects.
		}
		return;
	}
	if ((op & 0xfce0) == 0xf0c0) // XOR source accumulator, shift, destination accumulator
	{
		const int shift = s8(u8(op << 3)) >> 3;
		u64 source = accumulator(BIT(op, 9));
		if (shift >= 0)
			source = (source << shift) & ACC_MASK;
		else
			source >>= -shift;
		u64 &destination = accumulator(BIT(op, 8));
		destination ^= source;
		destination &= ACC_MASK;
		return;
	}
	switch (op & 0xff00)
	{
	case 0x1000: // LD Smem, A
		m_a = data_operand(indirect_read(low));
		return;
	case 0x1100: // LD Smem, B
		m_b = data_operand(indirect_read(low));
		return;
	case 0x1200: // LD uns(Smem), A
		m_a = indirect_read(low);
		return;
	case 0x1300: // LD uns(Smem), B
		m_b = indirect_read(low);
		return;
	case 0x3000: case 0x3100: case 0x3200: case 0x3300:
	case 0x3400: case 0x3500: case 0x3600: case 0x3700:
	case 0x3800: case 0x3900: case 0x3a00: case 0x3b00:
	case 0x3c00: case 0x3d00: case 0x3e00: case 0x3f00:
	{
		const unsigned family = (op >> 8) & 0x0f;
		const u16 memory = indirect_read(low);
		if (family == 0)
		{
			m_t = memory;
			return;
		}
		if (family == 2)
		{
			m_st1 = (m_st1 & ~u16(0x001f)) | (memory & 0x001f);
			return;
		}
		if (family == 4)
		{
			const bool bit = BIT(memory, 15 - (m_t & 0x0f));
			m_st0 = (m_st0 & ~u16(0x1000)) | (bit ? 0x1000 : 0);
			return;
		}
		if (family == 1 || family == 3 || family == 5 || family == 7)
		{
			s64 product = s64(s16(m_a >> 16)) * s64(s16(memory));
			if (BIT(m_st1, 6))
				product <<= 1;
			s64 result = family == 1 ? product :
					family == 3 ? (s64(m_b << 24) >> 24) - product :
					(s64(m_b << 24) >> 24) + product;
			if (family == 7)
				result = (result + 0x8000) & ~s64(0xffff);
			m_b = u64(result) & ACC_MASK;
			m_t = memory;
			return;
		}
		if (family == 6)
		{
			s64 product = s64(s16(m_a >> 16)) * s64(s16(m_t));
			if (BIT(m_st1, 6))
				product <<= 1;
			m_a = u64((product + (s64(m_b << 24) >> 24) + 0x8000) & ~s64(0xffff)) & ACC_MASK;
			const s64 value = BIT(m_st1, 8) ? s64(s16(memory)) : s64(memory);
			m_b = u64(value << 16) & ACC_MASK;
			return;
		}
		if (family >= 8 && family <= 0x0b)
		{
			s64 product = s64(s16(memory)) * s64(s16(memory));
			if (BIT(m_st1, 6))
				product <<= 1;
			m_t = memory;
			u64 &destination = accumulator(BIT(family, 0));
			const s64 current = s64(destination << 24) >> 24;
			destination = u64(BIT(family, 1) ? current - product : current + product) & ACC_MASK;
			return;
		}
		const s64 value = (BIT(m_st1, 8) ? s64(s16(memory)) : s64(memory)) << 16;
		const u64 source = accumulator(BIT(family, 1));
		accumulator(BIT(family, 0)) = (source + u64(value)) & ACC_MASK;
		return;
	}
	case 0x0000: // ADD Smem, A
		m_a = (m_a + data_operand(indirect_read(low))) & ACC_MASK;
		return;
	case 0x0100: // ADD Smem, B
		m_b = (m_b + data_operand(indirect_read(low))) & ACC_MASK;
		return;
	case 0x0200: // ADD uns(Smem), A
		m_a = (m_a + indirect_read(low)) & ACC_MASK;
		return;
	case 0x0600: // ADDC Smem, A
	case 0x0700: // ADDC Smem, B
	{
		// ADDC zero-extends Smem and consumes ST0.C. Carry is defined at
		// the 32-bit accumulator boundary, independently of the guard byte.
		u64 &destination = accumulator(BIT(op, 8));
		const u64 operand = u64(indirect_read(low)) + (BIT(m_st0, 11) ? 1 : 0);
		const u64 low_result = u64(u32(destination)) + operand;
		destination = (destination + operand) & ACC_MASK;
		if (low_result > 0xffffffffU)
			m_st0 |= 0x0800;
		else
			m_st0 &= ~u16(0x0800);
		return;
	}
	case 0x0800: // SUB Smem, A
		m_a = (m_a - data_operand(indirect_read(low))) & ACC_MASK;
		return;
	case 0x0900: // SUB Smem, B
		m_b = (m_b - data_operand(indirect_read(low))) & ACC_MASK;
		return;
	case 0x0a00: // SUBS Smem, A
		m_a = (m_a - indirect_read(low)) & ACC_MASK;
		return;
	case 0x0b00: // SUBS Smem, B
		m_b = (m_b - indirect_read(low)) & ACC_MASK;
		return;
	case 0x1800: // AND Smem, A
		m_a &= indirect_read(low);
		return;
	case 0x1900: // AND Smem, B
		m_b &= indirect_read(low);
		return;
	case 0x1a00: // OR Smem, A
		m_a = (m_a | indirect_read(low)) & ACC_MASK;
		return;
	case 0x1b00: // OR Smem, B
		m_b = (m_b | indirect_read(low)) & ACC_MASK;
		return;
	case 0x1c00: // XOR Smem, A
		m_a = (m_a ^ indirect_read(low)) & ACC_MASK;
		return;
	case 0x1d00: // XOR Smem, B
		m_b = (m_b ^ indirect_read(low)) & ACC_MASK;
		return;
	case 0x1e00: // SUBC Smem, A
	case 0x5e00: // SUBC Smem, B
	{
		u64 &source = accumulator(BIT(op, 14));
		const u64 divisor = data_operand(indirect_read(low));
		const s64 difference = (s64(source << 24) >> 24) -
				(s64(divisor << 24) >> 24) * 0x8000;
		const bool subtract = difference >= 0;
		source = (subtract ? (u64(difference) << 1) | 1 : source << 1) &
				ACC_MASK;
		m_st0 = (m_st0 & ~u16(0x0800)) | (subtract ? 0x0800 : 0);
		return;
	}
	case 0x2000: case 0x2100: // MPY Smem, A/B
	case 0x2200: case 0x2300: // MPYR Smem, A/B
	case 0x2400: case 0x2500: // MPYU Smem, A/B
	case 0x2600: case 0x2700: // SQUR Smem, A/B
	case 0x2800: case 0x2900: // MAC Smem, A/B
	case 0x2a00: case 0x2b00: // MACR Smem, A/B
	case 0x2c00: case 0x2d00: // MAS Smem, A/B
	case 0x2e00: case 0x2f00: // MASR Smem, A/B
	{
		const unsigned family = (op >> 8) & 0x0e;
		const u16 memory = indirect_read(low);
		s64 product;
		if (family == 0x04)
			product = s64(u16(m_t)) * s64(memory);
		else if (family == 0x06)
			product = s64(s16(memory)) * s64(s16(memory));
		else
			product = s64(s16(m_t)) * s64(s16(memory));
		if (BIT(m_st1, 6)) // FRCT
			product <<= 1;

