bitplane/nokia-dct3-re/cpu/tms320c54x/tms320c54x.cpp
		u64 &destination = accumulator(BIT(op, 8));
		s64 result;
		if (family <= 0x06)
			result = product;
		else if (family >= 0x0c)
			result = (s64(destination << 24) >> 24) - product;
		else
			result = (s64(destination << 24) >> 24) + product;
		if (family == 0x02 || family == 0x0a || family == 0x0e)
			result = (result + 0x8000) & ~s64(0xffff);
		destination = u64(result) & ACC_MASK;
		return;
	}
	case 0x4400: // LD Smem, 16, A
		m_a = (data_operand(indirect_read(low)) << 16) & ACC_MASK;
		return;
	case 0x4500: // LD Smem, 16, B
		m_b = (data_operand(indirect_read(low)) << 16) & ACC_MASK;
		return;
	case 0x4700: // RPT Smem
		m_rptc = indirect_read(low);
		m_rpt_address = m_pc;
		m_rpt_end = 0xffff;
		m_rpt_iteration = 0;
		m_rpt_armed = true;
		return;
	case 0x4b00: // PSHD Smem
		push(indirect_read(low));
		return;
	case 0x8c00: // ST T, Smem
		indirect_write(low, m_t);
		return;
	case 0x8b00: // POPD Smem
		indirect_write(low, pop());
		return;
	case 0x7f00: // WRITA Smem
	{
		const bool repeated = (m_rptc || m_rpt_end != 0xffff) &&
			u16(m_pc - 1) == m_rpt_address;
		m_program.write_word(u16(m_a) + (repeated ? m_rpt_iteration : 0),
				indirect_read(low));
		return;
	}
	case 0x6100: // BITF Smem, #lk
	{
		const u16 value = indirect_read(low);
		const u16 mask = fetch();
		m_st0 = (m_st0 & ~0x1000) | ((value & mask) ? 0x1000 : 0);
		return;
	}
	case 0x6000: // CMPM Smem, #lk
	{
		const u16 value = indirect_read(low);
		const u16 immediate = fetch();
		m_st0 = (m_st0 & ~0x1000) | (value == immediate ? 0x1000 : 0);
		return;
	}
	case 0x6f00: // Extended ALU/load/store Smem, shift, accumulator
	{
		const u16 address = low == 0xf8 ? fetch() : m_ar[low & 7];
		const u16 extension = fetch();
		const unsigned operation = (extension >> 5) & 7;
		const int shift = s8(u8(extension << 3)) >> 3;
		const bool destination_b = BIT(extension, 8);
		const bool source_b = BIT(extension, 9);
		auto shifted_memory = [this, address, shift] () -> u64
		{
			s64 value = BIT(m_st1, 8) ? s16(data_read(address)) : data_read(address);
			return shift >= 0 ? u64(value << shift) & ACC_MASK :
					u64(value >> -shift) & ACC_MASK;
		};
		u64 &destination = accumulator(destination_b);
		switch (operation)
		{
		case 0:
			destination = (accumulator(source_b) + shifted_memory()) & ACC_MASK;
			break;
		case 1:
			destination = (accumulator(source_b) - shifted_memory()) & ACC_MASK;
			break;
		case 2:
			destination = shifted_memory();
			break;
		case 3:
		{
			const s64 high = s16(accumulator(destination_b) >> 16);
			data_write(address, u16(shift >= 0 ? high << shift : high >> -shift));
			break;
		}
		case 4:
		{
			const s64 value = s64(accumulator(destination_b) << 24) >> 24;
			data_write(address, u16(shift >= 0 ? value << shift : value >> -shift));
			break;
		}
		default:
			logerror("%s: unimplemented C54x 6f extension %04x at %04x\n",
					machine().describe_context(), extension, u16(m_pc - 3));
			m_illegal = true;
			break;
		}
		if (low != 0xf8)
			indirect_modify(low);
		return;
	}
	case 0x4800: // LDM MMR, A
		m_a = data_operand(data_read(low & 0x7f));
		return;
	case 0x4900: // LDM MMR, B
		m_b = data_operand(data_read(low & 0x7f));
		return;
	case 0x4e00: // DST A, Lmem
	case 0x4f00: // DST B, Lmem
	{
		const unsigned ar = low & 7;
		const u16 address = (low == 0xf8 ? fetch() : m_ar[ar]) & 0xfffe;
		const u64 value = accumulator(BIT(op, 8));
		data_write(address, u16(value >> 16));
		data_write(address + 1, u16(value));
		if (low != 0xf8)
			indirect_modify(low);
		return;
	}
	case 0x5600: // DLD Lmem, A
	case 0x5700: // DLD Lmem, B
	{
		const unsigned ar = low & 7;
		const u16 address = (low == 0xf8 ? fetch() : m_ar[ar]) & 0xfffe;
		const u16 high = data_read(address);
		const u16 low_word = data_read(address + 1);
		u64 value = (u64(high) << 16) | low_word;
		// C16 dual mode and ordinary double-precision mode have the same
		// 32-bit payload layout here. SXM extends the high halfword into the
		// accumulator guard byte in either mode.
		if (BIT(m_st1, 8) && BIT(high, 15))
			value |= u64(0xff) << 32;
		accumulator(BIT(op, 8)) = value;
		if (low != 0xf8)
			indirect_modify(low);
		return;
	}
	case 0x6800: // AND #lk, Smem
	case 0x6900: // OR #lk, Smem
	{
		const unsigned ar = low & 7;
		const u16 address = low == 0xf8 ? fetch() : m_ar[ar];
		const u16 immediate = fetch();
		const u16 value = data_read(address);
		data_write(address, (op & 0xff00) == 0x6800
				? value & immediate : value | immediate);
		if (low != 0xf8)
			indirect_modify(low);
		return;
	}
	case 0x6b00: // ADD #lk, Smem
	{
		const unsigned ar = low & 7;
		const u16 address = low == 0xf8 ? fetch() : m_ar[ar];
		const u16 immediate = fetch();
		data_write(address, data_read(address) + immediate);
		if (low != 0xf8)
			indirect_modify(low);
		return;
	}
	case 0x6c00: // BANZ pmad, *ARx modification
	{
		const unsigned ar = low & 7;
		const bool branch = m_ar[ar] != 0;
		indirect_modify(low);
		const u16 destination = fetch();
		if (branch)
			m_pc = destination;
		return;
	}
	case 0x6e00: // BANZD pmad, *ARx modification
	{
		const unsigned ar = low & 7;
		const bool branch = m_ar[ar] != 0;
		indirect_modify(low);
		const u16 destination = fetch();
		if (branch)
		{
			m_delayed_target = destination;
			m_delayed_words = 2;
		}
		return;
	}
	case 0x8000: // STL A, Smem
		indirect_write(low, u16(m_a));
		return;
	case 0x8100: // STL B, Smem
		indirect_write(low, u16(m_b));
		return;
	case 0x8200: // STH A, Smem
		indirect_write(low, u16(m_a >> 16));
		return;
	case 0x8300: // STH B, Smem
		indirect_write(low, u16(m_b >> 16));
		return;
	case 0xe800: // LD #k, A
		m_a = data_operand(low);
		return;
	case 0xe900: // LD #k, B
		m_b = data_operand(low);
		return;
	case 0xee00: // FRAME #k8
		m_sp = u16(m_sp + s8(low));
		return;
	case 0x8800: // STLM A, MMR
		data_write(low & 0x7f, u16(m_a));
		return;
	case 0x8900: // STLM B, MMR
		data_write(low & 0x7f, u16(m_b));
		return;
	case 0x7100: // MVDM Smem, dmad
	{
		const bool repeated = (m_rptc || m_rpt_end != 0xffff) &&
			u16(m_pc - 1) == m_rpt_address;
		const u16 value = indirect_read(low);
		const u16 destination = fetch() + (repeated ? m_rpt_iteration : 0);
		data_write(destination, value);
		return;
	}
	case 0x7300: // MVDM MMR, dmad
		data_write(fetch(), data_read(low & 0x7f));
		return;
	case 0x7400: // PORTR port, Smem
		if (low == 0xf8)
		{
			const u16 destination = fetch();
			data_write(destination, m_io.read_word(fetch()));
		}
		else
			indirect_write(low, m_io.read_word(fetch()));
		return;
	case 0x7500: // PORTW Smem, port
	{
		const u16 value = indirect_read(low);
		m_io.write_word(fetch(), value);
		return;
	}
	case 0x7000: // MVKD dmad, Smem
		indirect_write(low, data_read(fetch()));
		return;
	case 0x7200: // MVDM dmad, MMR
		data_write(low & 0x7f, data_read(fetch()));
		return;
	case 0x7600: // STM #lk, Smem
		if (low == 0xf8)
		{
			// The absolute Smem extension precedes the immediate extension.
			// Keep the fetch order explicit; passing fetch() as the helper
			// argument reverses these words before indirect_write fetches the
			// address.
			const u16 address = fetch();
			const u16 value = fetch();
			data_write(address, value);
		}
		else
			indirect_write(low, fetch());
		return;
	case 0x7700: // STM #lk, MMR
	{
		const u16 value = fetch();
		const unsigned reg = low & 0x7f;
		data_write(reg, value);
		return;
	}
	case 0x7d00: // MVDP Smem, pmad
	{
		const bool repeated = (m_rptc || m_rpt_end != 0xffff) &&
			u16(m_pc - 1) == m_rpt_address;
		const u16 value = indirect_read(low);
		const u16 destination = fetch() + (repeated ? m_rpt_iteration : 0);
		m_program.write_word(destination, value);
		return;
	}
	case 0x7c00: // MVPD pmad, Smem
	{
		const u16 destination = low == 0xf8 ? fetch() : m_ar[low & 7];
		const u16 value = m_program.read_word(fetch());
		data_write(destination, value);
		if (low != 0xf8)
			indirect_modify(low);
		return;
	}
	case 0x7e00: // READA Smem
	{
		const bool repeated = (m_rptc || m_rpt_end != 0xffff) &&
			u16(m_pc - 1) == m_rpt_address;
		const u16 value = m_program.read_word(u16(m_a) +
				(repeated ? m_rpt_iteration : 0));
		indirect_write(low, value);
		return;
	}
	case 0xe700: // MVDK source auxiliary register to destination MMR
	{
		const unsigned source = (low >> 4) & 7;
		const unsigned destination = low & 7;
		m_ar[destination] = m_ar[source];
		return;
	}
	default:
		break;
	}

	if ((op & 0xff00) == 0xe500) // MVDD Xmem, Ymem
	{
		const u8 x = op >> 4;
		const u8 y = op;
		const unsigned xar = 2 + (x & 3);
		const unsigned yar = 2 + (y & 3);
		const u16 source_address = m_ar[xar];
		const u16 destination_address = m_ar[yar];
		const u16 value = data_read(source_address);
		data_write(destination_address, value);
		dual_modify(x);
		// When both operands select the same AR with different modifiers, the
		// X operand's modifier owns the address update (SPRU131G section 5.5.4).
		if (xar != yar)
			dual_modify(y);
		return;
	}
	if ((op & 0xfe00) == 0xa400) // MPY Xmem, Ymem, A/B
	{
		const u8 x = op >> 4;
		const u8 y = op;
		const unsigned xar = 2 + (x & 3);
		const unsigned yar = 2 + (y & 3);
		const u16 xvalue = data_read(m_ar[xar]);
		const u16 yvalue = data_read(m_ar[yar]);
		s64 product = s64(s16(xvalue)) * s64(s16(yvalue));
		if (BIT(m_st1, 6))
			product <<= 1;
		accumulator(BIT(op, 8)) = u64(product) & ACC_MASK;
		m_t = xvalue;
		dual_modify(x);
		if (xar != yar)
			dual_modify(y);
		return;
	}
	if ((op & 0xf000) == 0xb000) // MAC[R] Xmem, Ymem, src, dst
	{
		const u8 x = op >> 4;
		const u8 y = op;
		const unsigned xar = 2 + (x & 3);
		const unsigned yar = 2 + (y & 3);
		const u16 xvalue = data_read(m_ar[xar]);
		const u16 yvalue = data_read(m_ar[yar]);
		s64 product = s64(s16(xvalue)) * s64(s16(yvalue));
		if (BIT(m_st1, 6))
			product <<= 1;
		const u64 source = accumulator(BIT(op, 9)) & ACC_MASK;
		s64 result = (s64(source << 24) >> 24) + product;
		if (BIT(op, 10))
			result = (result + 0x8000) & ~s64(0xffff);
		accumulator(BIT(op, 8)) = u64(result) & ACC_MASK;
		m_t = xvalue;
		dual_modify(x);
		if (xar != yar)
			dual_modify(y);
		return;
	}
	if ((op & 0xf800) == 0xd000) // ST src, Ymem || MAC[R] Xmem, dst
	{
		const u8 x = op >> 4;
		const u8 y = op;
		const unsigned xar = 2 + (x & 3);
		const unsigned yar = 2 + (y & 3);
		const u16 xvalue = data_read(m_ar[xar]);
		const u16 destination_address = m_ar[yar];
		const u64 source = accumulator(BIT(op, 9)) & ACC_MASK;
		const int asm_shift = s8((m_st1 & 0x001f) << 3) >> 3;
		data_write(destination_address,
			u16(arithmetic_shift_right(source, 16 - asm_shift)));

