bitplane/nokia-dct3-re/cpu/tms320c54x/tms320c54x.cpp
		s64 product = s64(s16(m_t)) * s64(s16(xvalue));
		if (BIT(m_st1, 6))
			product <<= 1;
		const u64 old_destination = accumulator(BIT(op, 8)) & ACC_MASK;
		s64 result = (s64(old_destination << 24) >> 24) + product;
		if (BIT(op, 10))
			result = (result + 0x8000) & ~s64(0xffff);
		accumulator(BIT(op, 8)) = u64(result) & ACC_MASK;
		dual_modify(x);
		if (xar != yar)
			dual_modify(y);
		return;
	}
	if ((op & 0xff00) == 0xe200) // SQDST Xmem, Ymem
	{
		const u8 x = op >> 4;
		const u8 y = op;
		const unsigned xar = 2 + (x & 3);
		const unsigned yar = 2 + (y & 3);
		const s32 xvalue = s16(data_read(m_ar[xar]));
		const s32 yvalue = s16(data_read(m_ar[yar]));
		const s64 old_a_high = s16(m_a >> 16);
		s64 square = old_a_high * old_a_high;
		if (BIT(m_st1, 6))
			square <<= 1;
		const u64 old_b = m_b & ACC_MASK;
		m_b = u64((s64(old_b << 24) >> 24) + square) & ACC_MASK;
		m_a = u64(s64(xvalue - yvalue) << 16) & ACC_MASK;
		dual_modify(x);
		if (xar != yar)
			dual_modify(y);
		return;
	}
	if ((op & 0xff80) == 0xf900) // CC pmad, condition
	{
		const u8 condition = op;
		const u16 destination = fetch();
		bool take = false;
		if (BIT(condition, 6))
		{
			const bool b = BIT(condition, 3);
			const u64 raw = accumulator(b) & ACC_MASK;
			const s64 value = s64(raw << 24) >> 24;
			switch (condition & 7)
			{
			case 2: take = value >= 0; break;
			case 3: take = value < 0; break;
			case 4: take = raw != 0; break;
			case 5: take = raw == 0; break;
			case 6: take = value > 0; break;
			case 7: take = value <= 0; break;
			default: take = true; break;
			}
			if ((condition & 0x70) == 0x70)
				take = BIT(m_st0, b ? 9 : 10);
			else if ((condition & 0x70) == 0x60)
				take = !BIT(m_st0, b ? 9 : 10);
		}
		else if ((condition & 0x30) == 0x30)
			take = BIT(m_st0, 12);
		else if ((condition & 0x30) == 0x20)
			take = !BIT(m_st0, 12);
		else if ((condition & 0x0c) == 0x0c)
			take = BIT(m_st0, 11);
		else if ((condition & 0x0c) == 0x08)
			take = !BIT(m_st0, 11);
		else
			take = true;
		if (take)
		{
			push(m_pc);
			m_pc = destination;
			m_icount -= 3;
		}
		return;
	}

	switch (op)
	{
	case 0x34f8: // BITT dmad
	{
		const u16 value = data_read(fetch());
		m_st0 = (m_st0 & ~0x1000) |
			(BIT(value, m_t & 0x0f) ? 0x1000 : 0);
		return;
	}
	case 0xfc00: // RET
		m_pc = pop();
		m_icount -= 4;
		return;
	case 0xf4eb: // RETE
		m_pc = pop();
		m_st1 &= ~0x0800;
		m_icount -= 4;
		return;
	case 0xf49b: // RETF
		m_pc = m_rtn;
		pop();
		m_st1 &= ~0x0800;
		m_icount -= 2;
		return;
	case 0xfc30: // RETC TC
		if (m_st0 & 0x1000)
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xfc45: // RETC AEQ
		if ((m_a & ACC_MASK) == 0)
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xfc47: // RETC ALEQ
		if ((s64(m_a << 24) >> 24) <= 0)
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xfc20: // RETC NTC
		if (!(m_st0 & 0x1000))
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xfc4b: // RC BLT
		if ((s64(m_b << 24) >> 24) < 0)
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xfc4d: // RC BEQ
		if ((m_b & ACC_MASK) == 0)
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xfc44: // RC ANEQ
		if ((m_a & ACC_MASK) != 0)
		{
			m_pc = pop();
			m_icount -= 4;
		}
		return;
	case 0xf072: // RPTB pmad
		m_rsa = u16(m_pc + 1);
		m_rea = fetch();
		m_block_repeat_active = true;
		m_st1 |= ST1_BRAF;
		m_icount -= 3;
		return;
	case 0xf272: // RPTBD pmad
		m_rea = fetch();
		// The two words after the two-word instruction are delay slots.  The
		// repeated block begins immediately after them.
		m_rsa = u16(m_pc + 2);
		m_block_repeat_active = true;
		m_st1 |= ST1_BRAF;
		m_icount -= 3;
		return;
	case 0xf071: // RPTZ A, #lk
	case 0xf171: // RPTZ B, #lk
		accumulator(BIT(op, 8)) = 0;
		m_rptc = fetch();
		m_rpt_address = m_pc;
		m_rpt_end = 0xffff;
		m_rpt_iteration = 0;
		m_rpt_armed = true;
		return;
	case 0xf074: // CALL pmad
	{
		const u16 destination = fetch();
		push(m_pc);
		m_pc = destination;
		m_icount -= 3;
		return;
	}
	case 0xf073: // B pmad
		m_pc = fetch();
		m_icount -= 3;
		return;
	case 0xf4e2: // BACC A
	case 0xf5e2: // BACC B
		m_pc = u16(accumulator(BIT(op, 8)));
		m_icount -= 5;
		return;
	case 0xf493: // CMPL source accumulator, destination accumulator
	case 0xf593:
	case 0xf693:
	case 0xf793:
		accumulator(BIT(op, 8)) = ~accumulator(BIT(op, 9)) & ACC_MASK;
		return;
	case 0xf065: // XOR #lk, 16, source accumulator, destination accumulator
	case 0xf165:
	case 0xf265:
	case 0xf365:
		accumulator(BIT(op, 8)) =
				(accumulator(BIT(op, 9)) ^ (u64(fetch()) << 16)) & ACC_MASK;
		return;
	case 0xf274: // CALLD pmad
	{
		const u16 destination = fetch();
		push(u16(m_pc + 2));
		m_delayed_target = destination;
		m_delayed_words = 2;
		m_icount -= 3;
		return;
	}
	case 0xf273: // BD pmad
		m_delayed_target = fetch();
		m_delayed_words = 2;
		m_icount -= 3;
		return;
	case 0xfa45: // BCD pmad, AEQ
	case 0xfa44: // BCD pmad, ANEQ
	case 0xfa20: // BCD pmad, NTC
	case 0xfa30: // BCD pmad, TC
	case 0xfa4d: // BCD pmad, BEQ
	{
		const u16 destination = fetch();
		const bool condition = op == 0xfa45 ? (m_a & ACC_MASK) == 0 :
				op == 0xfa44 ? (m_a & ACC_MASK) != 0 :
				op == 0xfa4d ? (m_b & ACC_MASK) == 0 :
				op == 0xfa30 ? bool(m_st0 & 0x1000) : !(m_st0 & 0x1000);
		if (condition)
		{
			m_delayed_target = destination;
			m_delayed_words = 2;
			m_icount -= 2;
		}
		return;
	}
	case 0xfe00: // RETD
		m_delayed_target = pop();
		m_delayed_words = 2;
		m_icount -= 3;
		return;
	case 0xf495: // NOP
		return;
	case 0xf1c0: // XOR A, B
		m_b = (m_b ^ m_a) & ACC_MASK;
		return;
	case 0xf2a0: // OR B, A
		m_a = (m_a | m_b) & ACC_MASK;
		return;
	case 0xff45: // XC 2, AEQ
		if ((m_a & ACC_MASK) != 0)
			m_pc += 2;
		return;
	case 0xff20: // XC 2, NTC
		if (m_st0 & 0x1000)
			m_pc += 2;
		return;
	case 0xf846: // BC pmad, AGT
	{
		const u16 destination = fetch();
		if ((s64(m_a << 24) >> 24) > 0)
			m_pc = destination;
		return;
	}
	case 0xf843: // BC pmad, ALT
	{
		const u16 destination = fetch();
		if ((s64(m_a << 24) >> 24) < 0)
			m_pc = destination;
		return;
	}
	case 0xf820: // BC pmad, NTC
	{
		const u16 destination = fetch();
		if (!(m_st0 & 0x1000))
			m_pc = destination;
		return;
	}
	case 0xf830: // BC pmad, TC
	{
		const u16 destination = fetch();
		if (m_st0 & 0x1000)
			m_pc = destination;
		return;
	}
	case 0xf847: // BC pmad, ALEQ
	{
		const u16 destination = fetch();
		if ((s64(m_a << 24) >> 24) <= 0)
			m_pc = destination;
		return;
	}
	case 0xf845: // BC pmad, AEQ
	{
		const u16 destination = fetch();
		if ((m_a & ACC_MASK) == 0)
			m_pc = destination;
		return;
	}
	case 0xf844: // BC pmad, ANEQ
	{
		const u16 destination = fetch();
		if ((m_a & ACC_MASK) != 0)
			m_pc = destination;
		return;
	}
	case 0xf84c: // BC pmad, BNEQ
	{
		const u16 destination = fetch();
		if ((m_b & ACC_MASK) != 0)
			m_pc = destination;
		return;
	}
	case 0xf84d: // BC pmad, BEQ
	{
		const u16 destination = fetch();
		if ((m_b & ACC_MASK) == 0)
			m_pc = destination;
		return;
	}
	case 0xf84e: // BC pmad, BGT
	{
		const u16 destination = fetch();
		if ((s64(m_b << 24) >> 24) > 0)
			m_pc = destination;
		return;
	}
	case 0xf84a: // BC pmad, BGEQ
	{
		const u16 destination = fetch();
		if ((s64(m_b << 24) >> 24) >= 0)
			m_pc = destination;
		return;
	}
	case 0xf84b: // BC pmad, BLT
	{
		const u16 destination = fetch();
		if ((s64(m_b << 24) >> 24) < 0)
			m_pc = destination;
		return;
	}
	case 0xf842: // BC pmad, AGEQ
	{
		const u16 destination = fetch();
		if ((s64(m_a << 24) >> 24) >= 0)
			m_pc = destination;
		return;
	}
	case 0xf0c8: // XOR A << 8, A
		m_a = (m_a ^ (m_a << 8)) & ACC_MASK;
		return;
	case 0xf3c8: // XOR B << 8, B
		m_b = (m_b ^ (m_b << 8)) & ACC_MASK;
		return;
	case 0xf030: // AND #lk, A
		m_a &= fetch();
		return;
	case 0xf130: // AND #lk, A, B
		m_b = m_a & fetch();
		return;
	case 0xf040: // OR #lk, A
		m_a = (m_a | fetch()) & ACC_MASK;
		return;
	case 0xf063: // AND #lk << 16, A
		m_a &= u64(fetch()) << 16;
		return;
	case 0xf340: // OR #lk, B
		m_b = (m_b | fetch()) & ACC_MASK;
		return;
	case 0xf020: // LD #lk, A
		m_a = data_operand(fetch());
		return;
	case 0xf062: // LD #lk, 16, A
		m_a = (data_operand(fetch()) << 16) & ACC_MASK;
		return;
	case 0xf362: // LD #lk, 16, B
		m_b = (data_operand(fetch()) << 16) & ACC_MASK;
		return;
	case 0xf330: // AND #lk, B
		m_b &= fetch();
		return;
	case 0xf230: // AND #lk, B, A
		m_a = m_b & fetch();
		return;
	case 0xf0e8: // ROL A, 8
		m_a = ((m_a << 8) | (m_a >> 32)) & ACC_MASK;
		return;
	case 0xf3e8: // ROL B, 8
		m_b = ((m_b << 8) | (m_b >> 32)) & ACC_MASK;
		return;
	case 0xf0f8: // ROR A, 8
		m_a = ((m_a >> 8) | (m_a << 32)) & ACC_MASK;
		return;
	case 0xf3f8: // ROR B, 8
		m_b = ((m_b >> 8) | (m_b << 32)) & ACC_MASK;
		return;
	case 0xf0ff: // SFTA A, -1
		m_a = arithmetic_shift_right(m_a, 1);
		return;
	case 0xf3ff: // SFTA B, -1
		m_b = arithmetic_shift_right(m_b, 1);
		return;
	case 0xf0b0: // OR A >> 16, A
		m_a |= arithmetic_shift_right(m_a, 16);
		return;
	case 0xf3b0: // OR B >> 16, B
		m_b |= arithmetic_shift_right(m_b, 16);
		return;
	case 0xf000: // ADD #lk, A
		m_a = (m_a + data_operand(fetch())) & ACC_MASK;
		return;
	case 0xf300: // ADD #lk, B
		m_b = (m_b + data_operand(fetch())) & ACC_MASK;
		return;
	case 0xf508: // ADD A << 8, B
		m_b = (m_b + (m_a << 8)) & ACC_MASK;
		return;
	case 0xf517: // ADD A >> 9, B
		m_b = (m_b + arithmetic_shift_right(m_a, 9)) & ACC_MASK;
		return;
	case 0xf010: // SUB #lk, A
		m_a = (m_a - data_operand(fetch())) & ACC_MASK;
		return;
	case 0xf310: // SUB #lk, B
		m_b = (m_b - data_operand(fetch())) & ACC_MASK;
		return;
	case 0xf210: // SUB #lk, B, A
		m_a = (m_b - data_operand(fetch())) & ACC_MASK;
		return;
	case 0xf491: // ROL A through carry
	case 0xf591: // ROL B through carry
	{
		u64 &acc = accumulator(BIT(op, 8));
		const u32 value = u32(acc);
		const u32 carry = BIT(m_st0, 11);
		m_st0 = (m_st0 & ~0x0800) | (BIT(value, 31) ? 0x0800 : 0);
		acc = u32((value << 1) | carry);
		return;
	}
	case 0xf490: // ROR A through carry
	case 0xf590: // ROR B through carry
	{
		u64 &acc = accumulator(BIT(op, 8));
		const u32 value = u32(acc);
		const u32 carry = BIT(m_st0, 11);
		m_st0 = (m_st0 & ~0x0800) | (BIT(value, 0) ? 0x0800 : 0);
		acc = (value >> 1) | (carry << 31);
		return;
	}
	default:
		if ((op & 0xfcff) == 0xf484) // NEG source accumulator, destination
		{
			const u64 source = accumulator(BIT(op, 9)) & ACC_MASK;
			const bool overflow = source == 0xff80000000ULL;
			u64 result = u64(-(s64(source << 24) >> 24)) & ACC_MASK;
			m_st0 = (m_st0 & ~u16(0x0800)) | (source ? 0 : 0x0800);
			if (overflow)
			{
				m_st0 |= BIT(op, 8) ? 0x0200 : 0x0400;
				if (BIT(m_st1, 9))
					result = 0x007fffffff;
			}
			accumulator(BIT(op, 8)) = result;
			return;
		}
		if ((op & 0xffe0) == 0xed00) // LD #k5, ASM
		{
			m_st1 = (m_st1 & ~u16(0x001f)) | (op & 0x001f);
			return;
		}
		if ((op & 0xffe0) == 0x4a00) // PSHM MMR
		{
			push(data_read(low & 0x7f));
			return;
		}
		if ((op & 0xffe0) == 0x8a00) // POPM MMR
		{
			data_write(low & 0x7f, pop());
			return;
		}
		if ((op & 0xff00) == 0xec00) // RPT #k
		{
			m_rptc = low;
			m_rpt_address = m_pc;
			m_rpt_end = 0xffff;
			m_rpt_iteration = 0;
			m_rpt_armed = true;
			return;
		}
		if (op == 0xf070) // RPT #lk
		{
			m_rptc = fetch();
			m_rpt_address = m_pc;
			m_rpt_end = 0xffff;
			m_rpt_iteration = 0;
			m_rpt_armed = true;
			return;
		}
		if ((op & 0xff00) == 0x6d00) // MAR indirect auxiliary-register modification
		{
			indirect_modify(low);
			return;
		}
		break;
	}

	logerror("%s: unimplemented C54x opcode %04x at %04x\n",
			machine().describe_context(), op, u16(m_pc - 1));
	m_illegal = true;
}

void tms320c54x_device::execute_run()
{
	while (m_icount > 0)
	{
		if (service_interrupt())
			continue;
		if (m_idle)
		{
			m_icount = 0;
			break;
		}
		debugger_instruction_hook(m_pc);
		if (m_illegal)
		{
			m_icount = 0;
			break;
		}

		const bool delayed = m_delayed_words != 0;
		const bool xc_guarded = m_xc_guard != 0;
		const u16 instruction_pc = m_pc;
		const bool repeat_was_armed = m_rpt_armed;
		m_op = fetch();
		if (m_opcode_first_pc[m_op] == 0xffff)
			m_opcode_first_pc[m_op] = instruction_pc;
		execute_one(m_op);
		if (!m_illegal)
		{
			// RPT/RPTZ arms the next instruction; its own retirement must not
			// consume one of the requested body executions.
			if (repeat_was_armed || !m_rpt_armed)
				finish_repeats();
			if (delayed)
			{
				const unsigned words = u16(m_pc - instruction_pc);
				m_delayed_words = words >= m_delayed_words ? 0 : m_delayed_words - words;
				if (!m_delayed_words)
					m_pc = m_delayed_target;
			}
			if (xc_guarded)
				--m_xc_guard;
		}
		--m_icount;
	}
}

void tms320c54x_device::execute_set_input(int inputnum, int state)
{
	if (inputnum >= 0 && inputnum < 16)
	{
		if (state != CLEAR_LINE)
		{
			m_ifr |= u16(1U << inputnum);
			m_idle = false;
		}
	}
}
